---
kind: property
id: P:Autodesk.Revit.DB.Visual.Noise.NoiseSize
source: html/e35ef81d-6838-8d52-f879-5a1d566b2fe0.htm
---
# Autodesk.Revit.DB.Visual.Noise.NoiseSize Property

The property labeled "Size" from the "Noise" schema.

## Syntax (C#)
```csharp
public static string NoiseSize { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0.001, 10000000000".